export const schemaErrorMessages = {
  name: {
    minLength: "Логін повинно містити принаймні 2 символи.",
    maxLength: "Логін повинно містити не більше 255 символів.",
    required: "Поле імені є обов'язковим.",
  },
  email: {
    minLength: "Електронна пошта повинна містити принаймні 4 символи.",
    maxLength: "Електронна пошта повинна містити не більше 255 символів.",
    matches:
      "Будь ласка, введіть дійсну адресу електронної пошти. Дозволені лише літери, цифри, підкреслення, крапки, дефіси та символ @.",
    required: "Поле електронної пошти є обов'язковим.",
  },
  password: {
    minLength: "Пароль повинен містити принаймні 8 символів.",
    maxLength: "Пароль повинен містити не більше 255 символів.",
    required: "Поле пароля є обов'язковим.",
  },
};
